In [1]:
import pandas as pd

A Series is a one-dimensional array-like object with an index

In [2]:
data = [10,20,30,40]
df = pd.Series(data)
print(df)

0    10
1    20
2    30
3    40
dtype: int64

You can also create a Series with custom index:

In [3]:
series= pd.Series([100,200,300], index = ['a','b','c'])
print(series)

a    100
b    200
c    300
dtype: int64

Creating the Pandas dataframe: A DataFrame is a table with rows and columns, like an Excel sheet.

In [4]:
data = {
    "Name": ["Alice","Zack","James"],
    "Age": [25,28,31],
    "City":["New York","New Jersey","China"]
}
df = pd.DataFrame(data)
df

    Name  Age        City
0  Alice   25    New York
1   Zack   28  New Jersey
2  James   31       China

Selecting data from Dataframe

In [5]:
# Selecting columns
## name = df['ColumnName']
# print(name)

In [6]:
###Selecting Rows
"""
print(df.iloc[0]) #selecting first row 
print(df.loc[1]) # selecting row by index
"""

'\nprint(df.iloc[0]) #selecting first row \nprint(df.loc[1]) # selecting row by index\n'

In [7]:
#exercise 1
data = [15,30,45,60,75]
df1 = pd.Series(data)
df1

0    15
1    30
2    45
3    60
4    75
dtype: int64

In [8]:
#Create a dataframe with 3 columns (Name, Age, Salary) and add 5 rows.
data2 = {
    "Name" : ["Zack","Jamie","Sara","Joshua", "Sam"],
    "Age" : [27,24,26,30,30],
    "Salary" : [50000,42000,48000, 70000,68000]
}
df2 = pd.DataFrame(data2)

In [9]:
df2

     Name  Age  Salary
0    Zack   27   50000
1   Jamie   24   42000
2    Sara   26   48000
3  Joshua   30   70000
4     Sam   30   68000

In [10]:
df3 = df2.to_csv("data.csv", index = False)

In [11]:
df3 = pd.read_csv("data.csv").head()
df3

     Name  Age  Salary
0    Zack   27   50000
1   Jamie   24   42000
2    Sara   26   48000
3  Joshua   30   70000
4     Sam   30   68000

In [12]:
filtered_data = df3[df3["Age"] == 30]
filtered_data

     Name  Age  Salary
3  Joshua   30   70000
4     Sam   30   68000

In [13]:
filtered_data.iloc[0]

Name      Joshua
Age           30
Salary     70000
Name: 3, dtype: object

In [14]:
df3.loc[df3["Name"] == "Sam", "Salary"].iloc[0]

np.int64(68000)